================================================================================
Commands
================================================================================

echo "hello"

set hi "heelo"

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (quoted_word))
  (set
    (simple_word)
    (quoted_word)))

================================================================================
Commands with strange barewords
================================================================================

join , - -flag

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (simple_word)
    (simple_word)
    (simple_word)))

================================================================================
Procedures
================================================================================

proc foo {arg1 arg2 {arg3 default3} { arg4 default4 } } {
    echo "hello"
    echo "word$hi \$bye word"
}
proc f {{a w$][[]}} {}

--------------------------------------------------------------------------------

(source_file
  (procedure
    name: (simple_word)
    arguments: (arguments
      (argument
        name: (simple_word))
      (argument
        name: (simple_word))
      (argument
        name: (raw_word)
        default: (raw_word))
      (argument
        name: (raw_word)
        default: (raw_word)))
    body: (script
      (command
        name: (simple_word)
        arguments: (quoted_word))
      (command
        name: (simple_word)
        arguments: (quoted_word
          (variable_substitution
            (id))
          (escaped_character)))))
  (procedure
    name: (simple_word)
    arguments: (arguments
      (argument
        name: (raw_word)
        default: (raw_word)))
    body: (script)))

================================================================================
Comments
================================================================================

# this is a comment

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
Foreach
================================================================================

foreach a {1 2 3 4 5} {
    put $i
}

--------------------------------------------------------------------------------

(source_file
  (foreach
    (foreach_clauses
      (foreach_clause
        (list_item)
        (braced_word)))
    (script
      (command
        (simple_word)
        (variable_substitution
          (id))))))

================================================================================
Foreach multi
================================================================================

foreach {a b} {1 2 4 5} {
    put $i
}

--------------------------------------------------------------------------------

(source_file
  (foreach
    (foreach_clauses
      (foreach_clause
        (literal_list
          (list_item)
          (list_item))
        (braced_word)))
    (script
      (command
        (simple_word)
        (variable_substitution
          (id))))))

================================================================================
Foreach multimulti
================================================================================

foreach a {1 2 4 5} b {6 7 8 9} {
    put $i
}

--------------------------------------------------------------------------------

(source_file
  (foreach
    (foreach_clauses
      (foreach_clause
        (list_item)
        (braced_word))
      (foreach_clause
        (list_item)
        (braced_word)))
    (script
      (command
        (simple_word)
        (variable_substitution
          (id))))))

================================================================================
Conditionals
================================================================================

if 1 then {
    echo hi
} elseif {t} {
    echo hi
} else {
    echo bye
}

--------------------------------------------------------------------------------

(source_file
  (conditional
    (expr
      (int_literal))
    (script
      (command
        (simple_word)
        (simple_word)))
    (elseif
      (expr
        (bool_literal))
      (script
        (command
          (simple_word)
          (simple_word))))
    (else
      (script
        (command
          (simple_word)
          (simple_word))))))

================================================================================
Command substitution
================================================================================

echo [echo hello]

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)
        (simple_word)))))

================================================================================
Escaped string
================================================================================

echo "word$hi \$bye word"

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (quoted_word
      (variable_substitution
        (id))
      (escaped_character))))

================================================================================
Array set
================================================================================

set arr(my) 0
set arr(a,b) 0
set arr(}) 0
set arr({) 0
set arr(]) 0
set arr() 0
set arr(") 0
set arr(${f}_f) 0
set arr($arr(a)) 0

--------------------------------------------------------------------------------

(source_file
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (variable_substitution)
      (array_index_word))
    (simple_word))
  (set
    (array_name
      (simple_word)
      (variable_substitution
        (array_ref
          (id)
          (array_index_word))))
    (simple_word)))

================================================================================
Array ref
================================================================================

puts $arr(my)
puts $a($a$a)
# The comma doesn't terminate the word as it would in the $a,b case
puts $a(a,b)
puts $j($a,$b)
set $arr(})
set $arr({)
set $arr(])
set $arr()
set $arr(")
set $arr(${f}_f)
set $arr($arr(a))

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (command
    (simple_word)
    (variable_substitution
      (array_ref
        (id)
        (variable_substitution
          (id))
        (variable_substitution
          (id)))))
  (comment)
  (command
    (simple_word)
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (command
    (simple_word)
    (variable_substitution
      (array_ref
        (id)
        (variable_substitution
          (id))
        (array_index_word)
        (variable_substitution
          (id)))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (set
    (variable_substitution
      (array_ref
        (id))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (array_index_word))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (variable_substitution)
        (array_index_word))))
  (set
    (variable_substitution
      (array_ref
        (id)
        (variable_substitution
          (array_ref
            (id)
            (array_index_word)))))))

================================================================================
Namespaced vars
================================================================================

puts $::ns::var
puts $ns::var
set ::var 1
set var::v 1
lassign [list 1] ::ns::var(key)

--------------------------------------------------------------------------------

(source_file
  (command
    (simple_word)
    (variable_substitution
      (id)))
  (command
    (simple_word)
    (variable_substitution
      (id)))
  (set
    (simple_word)
    (simple_word))
  (set
    (simple_word)
    (simple_word))
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)
        (simple_word)))
    (array_name
      (simple_word)
      (array_index_word))))

================================================================================
Exprs
================================================================================

expr {1 + 1}
expr {3. / 4e-4}
expr {t eq tr}
expr { nO || Of }
expr { inf + nan - (1) + [p 1] }
expr { {} eq {123} }
expr { $arr(abc) eq [a ::ar(xyz)] }
expr { func() eq -1 }
expr { func(1, 2) }
expr {$a >0}
expr {$a eq0}
expr {"str"eq"str"}

--------------------------------------------------------------------------------

(source_file
  (expr_cmd
    (expr
      (binop_expr
        (int_literal)
        (int_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (float_literal)
        (float_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (bool_literal)
        (bool_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (bool_literal)
        (bool_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (binop_expr
          (binop_expr
            (float_literal)
            (float_literal))
          (int_literal))
        (command_substitution
          (command
            (simple_word)
            (simple_word))))))
  (expr_cmd
    (expr
      (binop_expr
        (braced_word)
        (braced_word))))
  (expr_cmd
    (expr
      (binop_expr
        (variable_substitution
          (array_ref
            (id)
            (array_index_word)))
        (command_substitution
          (command
            (simple_word)
            (array_name
              (simple_word)
              (array_index_word)))))))
  (expr_cmd
    (expr
      (binop_expr
        (func_call
          (expr_function_name))
        (unary_expr
          (int_literal)))))
  (expr_cmd
    (expr
      (func_call
        (expr_function_name)
        (func_args
          (int_literal)
          (int_literal)))))
  (expr_cmd
    (expr
      (binop_expr
        (variable_substitution
          (id))
        (int_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (variable_substitution
          (id))
        (int_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (quoted_word)
        (quoted_word)))))

================================================================================
Exprs in other places
================================================================================
if $a {
} elseif {1 eq 2} {}
if {
1
} {
puts "good"
}
while f {}
if 1+$a/0 {dostuff}
--------------------------------------------------------------------------------

(source_file
  (conditional
    (expr
      (variable_substitution
        (id)))
    (script)
    (elseif
      (expr
        (binop_expr
          (int_literal)
          (int_literal)))
      (script)))
  (conditional
    (expr
      (int_literal))
    (script
      (command
        (simple_word)
        (quoted_word))))
  (while
    (expr
      (bool_literal))
    (script))
  (conditional
    (expr
      (binop_expr
        (int_literal)
        (binop_expr
          (variable_substitution
            (id))
          (int_literal))))
    (script
      (command
        (simple_word)))))

================================================================================
Try
================================================================================

try { some code
} on error {} {
} on continue {var1 var2} {
  puts "continue"
} trap {PATTERN} {} {
} finally { done }

--------------------------------------------------------------------------------

(source_file
  (try
    (script
      (command
        (simple_word)
        (simple_word)))
    (literal_list)
    (script)
    (literal_list
      (list_item)
      (list_item))
    (script
      (command
        (simple_word)
        (quoted_word)))
    (raw_word)
    (literal_list)
    (script)
    (finally
      (script
        (command
          (simple_word))))))

================================================================================
For
================================================================================

for {set a 0} {$a < 10} {incr a} { puts $a }
for {set a 0} {$a < 10} {} {
}

--------------------------------------------------------------------------------

(source_file
  (for
    (script
      (set
        (simple_word)
        (simple_word)))
    (expr
      (binop_expr
        (variable_substitution
          (id))
        (int_literal)))
    (script
      (command
        (simple_word)
        (simple_word)))
    (script
      (command
        (simple_word)
        (variable_substitution
          (id)))))
  (for
    (script
      (set
        (simple_word)
        (simple_word)))
    (expr
      (binop_expr
        (variable_substitution
          (id))
        (int_literal)))
    (script)
    (script)))

================================================================================
Switch
================================================================================

switch -glob aaab {
    b       -
    r_rr     {[rrr]}
    *      {a}
    default {}
}

--------------------------------------------------------------------------------

(source_file
  (switch
    (simple_word)
    (simple_word)
    (switch_body
      (raw_word)
      (script)
      (raw_word)
      (script
        (command
          (command_substitution
            (command
              (simple_word)))))
      (raw_word)
      (script
        (command
          (simple_word)))
      (raw_word)
      (script))))

===
Command substitution of full scripts
===

puts [
p a
rty; party
]
---

(source_file
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)
        (simple_word))
      (command
        (simple_word))
      (command
        (simple_word)))))

=======
Variable substitution characters
=======

puts $::2::1
puts $_::_
puts [func]1
---

(source_file
  (command
    (simple_word)
    (variable_substitution
      (id)))
  (command
    (simple_word)
    (variable_substitution
      (id)))
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)))
    (concat)
    (simple_word)))

================================================================================
Exprs with newlines
================================================================================

expr {1
+ 1
}
expr {3. /
4e-4}
expr {
  t
eq tr}
expr { nan - (
1
)}
expr { arr
(f,t) eq arr(
123
,
456)
}
--------------------------------------------------------------------------------

(source_file
  (expr_cmd
    (expr
      (binop_expr
        (int_literal)
        (int_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (float_literal)
        (float_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (bool_literal)
        (bool_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (float_literal)
        (int_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (func_call
          (expr_function_name)
          (func_args
            (bool_literal)
            (bool_literal)))
        (func_call
          (expr_function_name)
          (func_args
            (int_literal)
            (int_literal)))))))

================================================================================
Braceless exprs
================================================================================

expr 1+1
expr 1
expr 3./4e-4
expr t==f
expr func(1,2)
expr 1+1 anything goes
----

(source_file
  (expr_cmd
    (expr
      (binop_expr
        (int_literal)
        (int_literal))))
  (expr_cmd
    (expr
      (int_literal)))
  (expr_cmd
    (expr
      (binop_expr
        (float_literal)
        (float_literal))))
  (expr_cmd
    (expr
      (binop_expr
        (bool_literal)
        (bool_literal))))
  (expr_cmd
    (expr
      (func_call
        (expr_function_name)
        (func_args
          (int_literal)
          (int_literal)))))
  (expr_cmd
    (expr
      (binop_expr
        (int_literal)
        (int_literal)))
    (simple_word)
    (simple_word)))

===
Force eval as script
===

puts [string cat {this is a script}]
puts {this is not a script}
puts [string length "abc"]
---

(source_file
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)
        (simple_word)
        (script
          (command
            (simple_word)
            (simple_word)
            (simple_word)
            (simple_word))))))
  (command
    (simple_word)
    (braced_word))
  (command
    (simple_word)
    (command_substitution
      (command
        (simple_word)
        (simple_word)
        (quoted_word)))))

===
Escapes in bare words
===
this\cmd
this\$cmd
---

(source_file
  (command
    (simple_word)
    (concat)
    (escaped_character)
    (concat)
    (simple_word))
  (command
    (simple_word)
    (concat)
    (escaped_character)
    (concat)
    (simple_word)))

===
Line continuations
===
puts \
"a string"
puts\
"a string"
puts\
 "a string"
puts "\
a string"
puts {\
a string}
cmd\
with\
args
cmd \
with \
args
# comment\
with cont
# comment \
# with cont
---

(source_file
  (command
    name: (simple_word)
    arguments: (quoted_word))
  (command
    name: (simple_word)
    arguments: (quoted_word))
  (command
    name: (simple_word)
    arguments: (quoted_word))
  (command
    name: (simple_word)
    arguments: (quoted_word))
  (command
    name: (simple_word)
    arguments: (braced_word))
  (command
    name: (simple_word)
    arguments: (simple_word)
    arguments: (simple_word))
  (command
    name: (simple_word)
    arguments: (simple_word)
    arguments: (simple_word))
  (comment)
  (comment))

===
Command separation
===
fn ;fn
fn; fn
fn; fn;
fn;fn ;
fn;;
---

(source_file
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word))
  (command
    (simple_word)))
